/**
* @file MeshComponent.cpp
* @brief ボーン処理
* @author GP12B183 12 小峰遥一
* @details
*/

#include "stdafx.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************



//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************


//*****************************************************************************
// グローバル変数
//*****************************************************************************


//=============================================================================
// 最初の子ボーンをセットする
// 既にセットされていた場合、セットされている子ボーンの兄弟ボーンとしてセットする
//=============================================================================
void Bone::SetFirstChild(Bone * pFirstChild)
{
	if (_pFirstChild == NULL)
	{
		_pFirstChild = pFirstChild;
	}
	else
	{
		_pFirstChild->SetSibling(pFirstChild);
	}
}



//=============================================================================
// 兄弟ボーンをセットする
// 既にセットされていた場合、セットできるまで兄弟ボーンをたどって再起処理を行う
//=============================================================================
void Bone::SetSibling(Bone * pSibling)
{
	if (_pSibling == NULL)
	{
		_pSibling = pSibling;
	}
	else
	{
		_pSibling->SetSibling(pSibling);
	}
}

//=============================================================================
// 初期化処理
//=============================================================================
void Bone::Init(int id, XMMATRIX mtxInit, XMFLOAT4X4 * pMtxCombAry)
{
	_pFirstChild = NULL;
	_pSibling = NULL;

	_id = id;
	XMStoreFloat4x4(&_mtxInit, mtxInit);
	XMStoreFloat4x4(&_mtxOffset, XMMatrixInverse(nullptr, mtxInit));
	XMStoreFloat4x4(&_mtxBone, mtxInit);
	_pMtxCombAry = pMtxCombAry;
}
